sdaiCreateNestedAggrByIndex(Sdai_Id_aggr*,System.UInt32)
\details
Creates an aggregate instance and replacing the member of the
aggregate instance referenced by the specified index.
\param aggregate [in]  aggregate which should be modified.
\param index [in] the place of modified item.
\returns Returns identifier of the newly created aggregate instance.